Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh95-v4.tmx
Source language: bo
Languages: en

source: །དབྱངས་ཀུན་མཐར་ཕྱིན་ཁྱོད་ལ་ཕྱག་འཚལ་ལོ།
en: Homage to you, who has reached the culmination of all melodious tunes!

source: །ཁྱོད་སྐྱབས་ཁྱོད་གླིང་ཁྱོད་ནི་དཔུང་གཉེན་ཏེ།
en: “You are protection, an island, the highest goal!

source: །ཁྱོད་ནི་འཇིག་རྟེན་མགོན་པོ་བྱམས་ཐུགས་མཛད།
en: You are the compassionate and loving lord of this world!

source: །ཁྱོད་ནི་སྨན་པའི་དམ་པ་ཟུག་རྔུ་འབྱིན།
en: You are the supreme physician, remover of thorns!

source: །གསོ་བ་ཕན་མཛད་ཁྱོད་ནི་དམ་པ་མཆོག །མར་མེ་མཛད་པ་གཟིགས་མ་ཐག་ཏུ་ཁྱོད།
en: You are the healer who brings sublime benefit! “As soon as you saw Buddha Dīpaṃkara,

source: །བྱམས་དང་ཐུགས་རྗེའི་སྤྲིན་གྱི་དྲ་བ་བསྒྲུབས།
en: You attained the cloud masses of love and compassion.

source: །མགོན་པོ་བདུད་རྩིའི་རྒྱུན་གྱི་ཆར་ཕོབ་ལ།
en: Release a torrential downpour of ambrosia, O Lord!

source: །ལྷ་མི་རྣམས་ཀྱི་གདུང་བ་ཞི་བར་མཛོད།
en: Quell the torment of gods and humans!

source: །ཁྱོད་ནི་སྲིད་གསུམ་མི་གོས་པད་མ་འདྲ།
en: “Like a lotus you are untainted by the three worlds!

source: །ཁྱོད་ནི་མི་གཡོ་མི་བསྐྱོད་ལྷུན་པོ་འདྲ།
en: Like Meru you are immovable and unshakable!

source: །ཁྱོད་ནི་ཐུགས་དམ་མི་གཡོ་རྡོ་རྗེ་བཞིན།
en: Like a vajra your pledge is unwavering!

source: །ཡོན་ཏན་མཆོག་ཀུན་མངའ་སྟེ་ཟླ་བ་འདྲ།
en: Like the moon you are replete with the best of all qualities!”

source: །དགེ་སློང་དག་དེ་ལྟར་འོད་གསལ་བའི་ལྷ་རྣམས་ཀྱིས་དེ་བཞིན་གཤེགས་པ་ལ་མངོན་པར་བསྟོད་ནས་ཐལ་མོ་སྦྱར་ཏེ། དེ་བཞིན་གཤེགས་པ་ལ་ཕྱག་འཚལ་ཞིང་ཕྱོགས་གཅིག་ཏུ་འཁོད་དོ།
en: Monks, once the luminous gods had praised the Thus-Gone One so, they bowed to him with palms joined and stood to one side.

source: །དེ་ནས་ལྷའི་བུ་རབ་ཚངས་པ་ལ་སོགས་པ་ཚངས་རིས་ཀྱི་ལྷ་རྣམས་ཀྱིས་དེ་བཞིན་གཤེགས་པ་བྱང་ཆུབ་ཀྱི་སྙིང་པོ་ལ་བཞུགས་པ་ལ་ནོར་བུ་རིན་པོ་ཆེ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་དུ་མས་སྤྲས་པའི་རིན་པོ་ཆེའི་དྲ་བས་བཀབ་སྟེ་ལན་གསུམ་བསྐོར་བ་བྱས་ནས་ཚུལ་དང་འཐུན་པའི་ཚིགས་སུ་བཅད་པ་འདི་དག་གིས་མངོན་པར་བསྟོད་དོ།
en: Then the gods from the Brahma realm, led by the son of gods, Subrahman, covered the Thus-Gone One sitting at the seat of awakening with a jewel net studded with many trillions of gems. They circumambulated him three times, then praised him with these fitting verses:

source: །དགེ་བ་དྲི་མེད་ཤེས་རབ་འོད་དང་གཟི་བརྗིད་ལྡན།
en: “With your virtuous and stainless insight, you radiate and shine.

source: །མཚན་གྱི་དམ་པ་སུམ་ཅུ་རྩ་གཉིས་མཆོག་མངའ་བ།
en: You are replete with the thirty-two most sublime characteristics;

source: །དྲན་དང་ལྡན་ཞིང་བློ་གྲོས་ལྡན་པ་ཡེ་ཤེས་མངའ།
en: Attentive and intelligent, you possess wisdom.

source: །མཉེལ་བ་མི་མངའ་ཁྱོད་ལ་མགོ་བོས་ཕྱག་འཚལ་ལོ།
en: Tireless One, to you we bow down.

source: །དྲི་གསུམ་དྲི་མི་མངའ་བ་དྲི་མེད་དྲི་མ་བྲལ།
en: “Utterly devoid of the three stains, you are stainless and pure.

source: །འཇིག་རྟེན་གསུམ་དུ་གྲགས་ཤིང་རིག་པ་གསུམ་བརྙེས་པ།
en: Renowned throughout the three worlds, discoverer of the threefold knowledge,

source: །རྣམ་པར་ཐར་པ་དམ་པ་གསུམ་གྱི་མིག་སྦྱིན་པ།
en: You bestow insight into the threefold liberation.

source: །སྤྱན་གསུམ་དྲི་མ་མི་མངའ་ཁྱོད་ལ་ཕྱག་འཚལ་ལོ།
en: We bow to you who possesses the three stainless eyes.

source: །དུས་ངན་རྙོག་པ་བསལ་ཞིང་རབ་ཏུ་ཞི་ཐུགས་ལྡན།
en: “You have banished this foul dark eon, you of well-restrained mind;

source: །ཐུགས་བརྩེ་ཐུགས་རྗེས་འཕགས་པ་འགྲོ་བའི་དོན་མཛད་པ།
en: Exalted in compassion and love, you work for the welfare of beings.

source: །ཐུབ་པ་དགྱེས་པས་འཕགས་པ་ཐུགས་ནི་རབ་ཞི་བ།
en: Sage Exalted in Joy, your mind is tranquil;

source: །ཁྱོད་ནི་ཡིད་གཉིས་གྲོལ་བར་མཛད་པ་བཏང་སྙོམས་དགྱེས།
en: Deliverer from Doubt, you delight in impartiality.

source: །བརྟུལ་ཞུགས་དཀའ་ཐུབ་འཕགས་པ་འགྲོ་བའི་དོན་མཛད་པ།
en: “Exalted in discipline and austerity, you act for the welfare of beings;

source: །རང་སྤྱོད་རྣམ་པར་དག་ཅིང་སྤྱོད་པའི་ཕ་རོལ་བྱོན།
en: Having purified your own conduct, you have reached the culmination of conduct.

source: །བདེན་པ་བཞི་པོ་སྟོན་པ་རྣམ་ཐར་དགྱེས་པ་པོ།
en: As the teacher of the four truths, you delight in emancipation;

source: །གྲོལ་བར་གྱུར་ནས་འགྲོ་བ་གཞན་ཡང་གྲོལ་མཛད་པ།
en: Being liberated yourself, you liberate other beings as well.

source: སྟོབས་དང་བརྩོན་འགྲུས་ལྡན་པའི་བདུད་པོ་འདིར་ལྷགས་པ།
en: “When Māra, powerful and persistent, arrived,

source: །ཤེས་རབ་བརྩོན་འགྲུས་དེ་བཞིན་བྱམས་པས་ཕམ་མཛད་ནས།
en: You defeated him with your insight, diligence, and love,

source: །ཁྱོད་ཀྱིས་གོ་འཕང་དམ་པ་འཆི་བ་མེད་པ་བརྙེས།
en: And then you attained the deathless supreme state.

source: །གཡོན་ཅན་དཔུང་རྣམས་བཅོམ་པ་ཁྱོད་ལ་ཕྱག་འཚལ་ལོ།
en: Vanquisher of the Villainous Hordes, to you we pay homage!”

source: །དགེ་སློང་དག་དེ་ལྟར་ལྷའི་བུ་རབ་ཚངས་པ་ལ་སོགས་པ་ཚངས་རིས་ཀྱི་ལྷ་རྣམས་ཀྱིས་དེ་བཞིན་གཤེགས་པ་ལ་ཚིགས་སུ་བཅད་པ་འདི་དག་གིས་མངོན་པར་བསྟོད་ནས་ཐལ་མོ་སྦྱར་ཏེ། དེ་བཞིན་གཤེགས་པ་ལ་ཕྱག་འཚལ་ཞིང་ཕྱོགས་གཅིག་ཏུ་འཁོད་དོ།
en: Monks, once the gods of the Brahma realm, led by the god Subrahman, had praised the Thus-Gone One with these verses, they bowed to him with palms joined and stood to one side.

source: །དེ་ནས་བདུད་ཀྱི་བུ་དཀར་པོའི་ཕྱོགས་པ་དེ་དག་དེ་བཞིན་གཤེགས་པ་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་པ་དང་། རིན་པོ་ཆེའི་གདུགས་དང་། བླ་རེ་ཆེན་པོ་རྣམས་ཀྱིས་དེ་བཞིན་གཤེགས་པ་མངོན་པར་བཀབ་ནས་ཐལ་མོ་སྦྱར་ཏེ།
en: Then those sons of Māra who were on the side of righteousness approached the Thus-Gone One and covered him with giant jewel parasols and canopies.

source: དེ་བཞིན་གཤེགས་པ་ལ་ཚུལ་དང་འཐུན་པའི་ཚིགས་སུ་བཅད་པ་འདི་དག་གིས་མངོན་པར་བསྟོད་དོ།
en: Then with palms joined, they praised the Thus-Gone One with these fitting verses:

source: །ཁྱོད་སྟོབས་ཤིན་ཏུ་རྒྱ་ཆེ་བ་དང་བདུད་དཔུང་དྲག་པོ་བདག་ཅག་མངོན་སུམ་སྟེ།
en: “When we, the dreadful army of Māra, appeared before you,

source: །བདུད་དཔུང་རབ་འཇིགས་ཆེན་པོ་དེ་ཡང་ཁྱོད་ཀྱིས་སྐད་ཅིག་གཅིག་ལ་ཕམ་པར་མཛད།
en: In your vast power, you vanquished instantaneously our terrifying demonic horde,

source: །ཁྱོད་ནི་བཞེངས་པར་མ་གྱུར་སྐུ་ཡང་མི་གཡོ་གསུང་ཡང་བརྗོད་པ་མ་མཛད་དེ།
en: Without rising, moving, or saying a word.

source: །ཐུབ་པ་དོན་ཀུན་འགྲུབ་པ་འཇིག་རྟེན་གསུམ་གྱིས་མཆོད་པ་ཁྱོད་ལ་བདག་ཕྱག་འཚལ།
en: Sage who accomplishes all aims and is honored in the three worlds, we pay homage to you!

source: །བདུད་ཀྱི་བུ་མོ་བྱེ་བ་ཁྲག་ཁྲིག་སྟོང་ཕྲག་དུ་མ་གང་གཱའི་བྱེ་མ་སྙེད།
en: “The trillions of demonesses, numerous as the grains of sand in the river Ganges,

source: །དེ་དག་རྣམས་ཀྱིས་བྱང་ཆུབ་ཤིང་མཆོག་དྲུང་ནས་ཁྱོད་ནི་བསྐྱོད་ཅིང་གཡོ་མ་ནུས།
en: Could not move or sway you from the trunk of the sublime Bodhi tree;

source: །མཆོད་སྦྱིན་བྱེ་བ་ཁྲག་ཁྲིག་སྟོང་ཕྲག་དུ་མ་གང་གཱའི་བྱེ་མ་སྙེད་མཛད་དེ།
en: They made trillions of offerings to you, as many as the grains of sand in the Ganges.

source: །བྱང་ཆུབ་ཤིང་དྲུང་བཞུགས་པ་དེས་ན་དེ་རིང་ཁྱོད་ནི་རྣམ་པར་མཛེས་པ་ལགས།
en: That is why, O Lord, seated here today at the foot of the Bodhi tree, you shine!

source: །བྱང་ཆུབ་སྤྱད་པ་དམ་པ་སྤྱོད་མཛད་ཚེ་ན་ཤིན་ཏུ་སྡུག་པའི་བཙུན་མོ་དང་། །ཕངས་པའི་སྲས་དང་བྲན་ཕོ་བྲན་མོ་དེ་བཞིན་སྐྱེད་མོས་ཚལ་དང་གྲོང་ཁྱེར་དང་། །ཡུལ་འཁོར་གྲོང་རྡལ་དག་དང་རྒྱལ་སྲིད་རྣམས་དང་བཙུན་མོའི་འཁོར་དང་གླང་པོ་དང་། །དབུ་དང་སྤྱན་དང་ལྗགས་དང་དེ་བཞིན་ཞབས་བཏང་དེས་ན་དེ་རིང་རྣམ་པར་མཛེས།
en: “While pursuing the conduct of supreme awakening, You gave up your dearest wives, beloved sons, servants, gardens, towns, Your cities, kingdoms, harems, and elephants, Your heads, eyes, tongues, and feet—that is why you shine today!

source: །ང་ནི་སངས་རྒྱས་འགྱུར་ཏེ་བསམ་གཏན་རྫུ་འཕྲུལ་བློ་ཡི་གོ་བགོས་ནས། །སེམས་ཅན་བྱེ་བ་ཁྲག་ཁྲིག་མང་པོ་སྡུག་བསྔལ་རྒྱ་མཚོས་ཁྱེར་བར་གྱུར་པ་རྣམས།
en: “ ‘As a buddha, wearing the armor of concentration, miraculous power, and intelligence, I myself will ferry across trillions of beings, swept away in the ocean of suffering,

source: །དམ་ཆོས་གྲུ་ཡིས་ཉིད་ཀྱིས་བསྒྲལ་བར་བྱ་ཞེས་ཁྱོད་ཀྱིས་ལན་མང་གསུང་བརྗོད་པ།
en: In the ship of the sublime Dharma.’ This aspiration that you repeatedly voiced

source: །ཁྱོད་ཀྱིས་སྨོན་ལམ་དེ་ནི་གྲུབ་ལགས་སྲོག་ཆགས་རྣམས་ཀྱང་སྒྲོལ་བར་མཛད་པར་འགྱུར།
en: Is now fulfilled, and you will liberate all beings!

source: །སྨྲ་བའི་ཁྱུ་མཆོག་འཇིག་རྟེན་མིག་སྦྱིན་མཛད་པ་ཁྱོད་ལ་བསྟོད་པའི་བསོད་ནམས་དེ།
en: “By the merit of praising you, Most Eminent of Speakers, who gave eyes to the world,

source: །བདག་ཅག་ཐམས་ཅད་དགའ་མགུ་ཡིད་གྱུར་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་སྨོན་ལམ་འདེབས།
en: May we all, rejoicing, aspire to omniscience!

source: །སངས་རྒྱས་རྣམས་ཀྱིས་རབ་བསྔགས་བྱང་ཆུབ་དམ་པ་མཚུངས་མེད་ཡང་དག་བསྒྲུབས་ནས་ནི།
en: As we attain the sublime and peerless awakening that all buddhas praise,

source: །དེ་ལྟར་བདུད་སྡེ་འཁོར་དེ་བཅོམ་ནས་ཐམས་ཅད་མཁྱེན་ཉིད་འཚང་རྒྱར་འགྱུར་བར་ཤོག །དགེ་སློང་དག་དེ་ལྟར་བདུད་ཀྱི་བུ་རྣམས་ཀྱིས་དེ་བཞིན་གཤེགས་པ་ལ་མངོན་པར་བསྟོད་ནས་ཐལ་མོ་སྦྱར་ཏེ། དེ་བཞིན་གཤེགས་པ་ལ་ཕྱག་འཚལ་ཞིང་ཕྱོགས་གཅིག་ཏུ་འཁོད་དོ།
en: May we defeat the demon hordes and awaken to omniscience!” Monks, once the sons of Māra had praised the Thus-Gone One in this manner, with palms joined they bowed to the Thus-Gone One and stood to one side.

source: །དེ་ནས་ལྷའི་བུ་གཞན་འཕྲུལ་དབང་བྱེད་ཀྱི་ལྷའི་བུ་བརྒྱ་སྟོང་དུ་མས་ཡོངས་སུ་བསྐོར་ཏེ། མདུན་དུ་བདར་ནས་དེ་བཞིན་གཤེགས་པ་ལ་འཛམ་བུ་ཀླུང་གི་གསེར་གྱི་པད་མ་དག་གིས་མངོན་པར་གཏོར་ཏེ།
en: Then a god from the Heaven of Making Use of Others’ Emanations, surrounded and escorted by millions of gods, sprinkled the Thus-Gone One with golden lotuses from the Jambū River.

source: སྤྱན་སྔ་ནས་ཚིགས་སུ་བཅད་པ་འདི་དག་གིས་མངོན་པར་བསྟོད་དོ།
en: Then, in his presence, they praised him with these verses:

source: །གསུང་ནི་དཔྱས་མ་མཆིས་ཤིང་མ་འཁྲུལ་རྣམ་པར་མ་འཁྲུགས་པ།
en: “Your speech is gentle, calm, and forthright;

source: །མུན་རྡུལ་བྲལ་ཞིང་འཆི་མེད་རྟོགས་པར་ཐུགས་སུ་ཆུད་པར་གྱུར།
en: Free of the stains of darkness, you have realized the immortal state.

source: །ལྷ་ཡུལ་མི་ཡུལ་པ་ཡི་དཔལ་དང་བགྱི་བ་གཞལ་མེད་འོས།
en: You deserve an unparalleled treatment in heaven and on earth;

source: །རབ་ཏུ་འབར་བའི་བློ་གྲོས་ལྡན་ལ་མགོ་བོས་ཕྱག་འཚལ་ལོ།
en: Your intelligence is blazing—to you we bow!

source: །དཀའ་བ་མཛད་པ་ཉོན་མོངས་སྤོང་བ་རྡུལ་དང་དྲི་མ་སེལ།
en: “You bring joy and have abandoned afflictions and removed stains and blemishes;

source: །ཤིན་ཏུ་དགའ་བའི་གསུང་གིས་ལྷ་དང་མི་རྣམས་དགའ་བར་མཛོད།
en: With your joyous speech, you delight gods and humans!

source: །སྐུ་མཆོག་འོད་ཟེར་རྒྱས་པ་དྲི་མ་ཤིན་ཏུ་མི་མངའ་བས།
en: With the light rays from your stainless and effulgent sublime body,

source: །ལྷ་དང་མི་ཡི་བདག་པོ་བཞིན་དུ་འགྲོ་བ་འདི་ལས་རྒྱལ།
en: You triumph over this world, like the master of gods and humans!

source: །ཕ་རོལ་ཚོགས་རྣམས་རབ་ཏུ་འཇོམས་པ་གཞན་གྱི་སྤྱོད་མཁས་པ།
en: “Vanquisher of Foes, you are knowledgeable in the conduct of others;

source: །ལྷ་དང་མི་ཡི་སྲིད་པར་དགའ་བ་གཞན་གྱི་བློ་སེལ་བ།
en: Beloved in the world of gods and humans, you overturn the thoughts of others;

source: །ཤིན་ཏུ་མཁས་པ་བློ་ལྡན་གཞན་གྱི་སྤྱོད་པ་རྣམ་པར་ཕྱེ།
en: Brilliant and Wise One, you illuminate the conduct of others.

source: །སྟོབས་བཅུ་མངའ་བ་གཤེགས་པའི་ལམ་འདིར་རྣམ་པར་རྒྱུ་བ་མཛོད།
en: Walk here on this path traversed by those with the ten powers!

source: །སྲིད་པ་འཛིན་དང་སྡུག་བསྔལ་ལོག་འཛིན་རྒྱ་ཆེན་འདོར་སེལ་ཏེ།
en: “Having relinquished the ubiquitous clinging to existence, suffering falsely construed,

source: །ལྷ་མི་བློ་གྲོས་འདུལ་བ་ཇི་ལྟ་བཞིན་དུ་འདུལ་བ་མཛོད།
en: May you train gods and humans by training their minds.

source: །ཟླ་བ་བཞིན་དུ་མཁའ་ལས་ཕྱོགས་བཞི་དག་ཏུ་རྣམ་རྒྱུ་བ།
en: May you course in the sky throughout the four directions like the moon,

source: །སྲིད་པ་གསུམ་འདིར་རྨད་བྱུང་མིག་དང་དཔུང་གཉེན་གྱུར་པར་ཤོག །ལྷ་དང་མི་ཡི་སྲིད་པ་དགའ་ཡང་ཡུལ་ལ་འཁྲུལ་མི་མངའ།
en: And so be a sublime eye and a final refuge in these three worlds! “Though beloved in the world of gods and humans, you do not gravitate toward sense objects;

source: །འདོད་པའི་དགའ་དང་བྲལ་ཞིང་དགེ་བའི་དགའ་ལ་དགྱེས་པ་པོ།
en: Without indulging in desire, you take pleasure in virtue.

source: །འཁོར་ལ་སྒྲོགས་པ་འཇིག་རྟེན་གསུམ་ན་ཁྱོད་དང་མཚུངས་མ་མཆིས།
en: Proclaimed far and wide, you are without equal in the three worlds;

source: །ཁྱོད་འདིར་འགྲོ་བ་རྣམས་ཀྱི་མགོན་དང་སྐྱབས་དང་དཔུང་གཉེན་ལགས།
en: You are the protector, the refuge, the only resort of beings here!”

source: །དགེ་སློང་དག་དེ་ལྟར་ལྷའི་བུ་དབང་སྒྱུར་ལ་སོགས་པ་གཞན་འཕྲུལ་དབང་བྱེད་ཀྱི་ལྷའི་བུ་རྣམས་ཀྱིས་དེ་བཞིན་གཤེགས་པ་ལ་མངོན་པར་བསྟོད་ནས་ཐལ་མོ་སྦྱར་ཏེ། །དེ་བཞིན་གཤེགས་པ་ལ་ཕྱག་འཚལ་ཞིང་ཕྱོགས་གཅིག་ཏུ་འཁོད་དོ།
en: Monks, once the gods from the Heaven of Making Use of Others’ Emanations, led by the god in charge, had praised the Thus-Gone One, with palms joined they bowed to him and stood to one side.

source: །དེ་ནས་ལྷའི་བུ་རབ་འཕྲུལ་རབ་འཕྲུལ་གྱི་ལྷའི་ཚོགས་ཀྱིས་ཡོངས་སུ་བསྐོར་ཅིང་མདུན་དུ་བདར་ཏེ། དེ་བཞིན་གཤེགས་པ་ལ་དར་གྱི་ལྡ་ལྡིས་གཡོགས་ནས་སྤྱན་སྔ་ནས་ཚིགས་སུ་བཅད་པ་འདི་དག་གིས་མངོན་པར་བསྟོད་དོ།
en: Next the god Sunirmita, surrounded and escorted by an assembly of gods from the Heaven of Delighting in Emanations, covered the Thus-Gone One with ribbons of silk studded with various gemstones, and in his presence praised him with these verses:

source: །དྲི་མ་རྣམ་གསུམ་སྤངས་པས་ཁྱོད་ནི་ཆོས་ཀྱི་སྣང་བ་ཡང་དག་འཕགས།
en: “You are the light of Dharma that has arisen from relinquishing the three stains;

source: །གཏི་མུག་དང་ནི་ལྟ་དང་མ་རིག་འཇོམས་པ་མཛེས་དང་དཔལ་གྱིས་རྒྱས།
en: You destroy delusion, beliefs, and ignorance, and unfold brilliance and glory!

source: །ལོག་པའི་ལམ་ལ་དགའ་བའི་སྐྱེ་བོ་འདི་དག་འཆི་མེད་འགོད་མཛད་པ།
en: You place in the deathless state those who indulge in the wrong path!

source: །འཇིག་རྟེན་འདིར་བྱུང་མཆོད་རྟེན་ལྷ་ཡུལ་བ་དང་མི་ཡུལ་བས་མཆོད་པ།
en: You are an object of veneration here in the world, honored in heaven and earth!

source: །ཁྱོད་ནི་གསོ་བའི་སྨན་པ་མཁས་པ་བདུད་རྩི་བདེ་བ་སྦྱིན་པ་པོ།
en: “You are a physician skilled in healing, who dispenses the elixir of happiness.

source: །ལྟ་དང་ཉོན་མོངས་པ་དང་མ་རིག་བསགས་པ་སྔོན་གྱི་བག་ལ་ཉལ། །ལུས་ཅན་རྣམས་ཀྱི་ནད་ཀུན་སྔོན་གྱི་རྒྱལ་བའི་ལམ་གྱིས་སེལ་བ་སྟེ།
en: Through the path of the previous victorious ones, you eradicate all illnesses of beings, The lingering symptoms of false belief, affliction, and ignorance that has accumulated.

source: །དེ་བས་སྨན་པ་དམ་པ་འདྲེན་པ་ཁྱོད་ནི་ས་ལ་རྣམ་པར་རྒྱུ།
en: For this reason, you are the sublime physician and guide who courses upon the earth.

source: །ཉི་ཟླའི་འོད་དང་སྐར་མ་རྣམས་དང་མེ་དང་དེ་བཞིན་ནོར་བུ་དང་། །བརྒྱ་བྱིན་ཚངས་པའི་འོད་རྣམས་དཔལ་སྡུག་སྤྱན་སྔར་ལམ་མེ་མ་ལགས་ཏེ།
en: “Sunlight, moonlight, stars, firelight, and the luster of jewels, The luster of Śakra and Brahmā—none of it shines in the presence of your splendor!

source: །ཤེས་རབ་སྣང་བ་མཛད་དང་འོད་མཛད་འོད་དང་དཔལ་གྱིས་རབ་ཏུ་རྒྱས།
en: With your brilliance and illuminating insight, you are replete with radiance and glory!

source: །ཁྱོད་ཀྱི་ཡེ་ཤེས་རྨད་བྱུང་མངོན་སུམ་གྱུར་པས་མགོ་བོས་ཕྱག་འཚལ་ལོ།
en: To you whose extraordinary wisdom has directly manifested, we bow down!

source: །རྣམ་པར་འདྲེན་པ་སྙན་པའི་གསུང་ལྡན་བདེན་དང་བདེན་མིན་གསུང་བ་དང་། །དུལ་བ་ཐུགས་ཞི་དབང་པོ་ཐུལ་བ་རབ་ཏུ་ཞི་བའི་ཐུགས་ལྡན་པ།
en: “Consummate Guide, whose melodious speech relates what is true and untrue, Whose mind is gentle, composed, with subdued sense faculties, and great calmness,

source: །སྟོན་པ་ལྷ་དང་མི་ཡི་འཁོར་ལ་བསྟན་པར་བགྱི་བ་སྟོན་མཛད་པ།
en: A teacher who can instruct the audiences of gods and humans in need of instruction,

source: །ཤཱཀྱ་ཐུབ་པ་མི་ཡི་ཁྱུ་མཆོག་ལྷ་མིས་མཆོད་ལ་ཕྱག་འཚལ་ལོ།
en: To you, Sage of the Śākyas, bull among men, honored by gods and humans, we pay homage!

source: །ཡེ་ཤེས་མངའ་བ་ཡེ་ཤེས་བཀའ་མཆིད་མཆོག་ཅན་སྲིད་གསུམ་གོ་མཛད་པ།
en: “In your intelligence, you hold wisdom instructions to be supreme and convey them throughout the three existences;

source: །དྲི་མ་གསུམ་བསལ་རིག་པ་གསུམ་དང་རྣམ་པར་ཐར་གསུམ་སྟོན་པ་པོ།
en: You remove the three stains and teach the threefold knowledge and the threefold liberation.

source: །ཐུབ་པ་བློ་གྲོས་ཇི་ལྟར་གདུལ་བ་སྐལ་དང་སྐལ་མེད་རབ་མཁྱེན་པ།
en: O Sage, you understand, according to intellect, who is a fitting vessel and who is not!

source: །སྟོང་གསུམ་རྨད་དུ་བྱུང་བ་ལྷ་མིས་མཆོད་པ་ཁྱོད་ལ་ཕྱག་འཚལ་ལོ།
en: To you, unique in the trichiliocosm and honored in heavens and on earth, we pay homage!”

source: །དགེ་སློང་དག་དེ་ལྟར་ལྷའི་བུ་རབ་འཕྲུལ་འཁོར་དང་བཅས་པས་དེ་བཞིན་གཤེགས་པ་ལ་མངོན་པར་བསྟོད་ནས་ཐལ་མོ་སྦྱར་ཏེ། དེ་བཞིན་གཤེགས་པ་ལ་ཕྱག་འཚལ་ཞིང་ཕྱོགས་གཅིག་ཏུ་འདུག་གོ།
en: Monks, once the god Sunirmita and his entourage had praised the Thus-Gone One, with palms joined they bowed down to the Thus-Gone One and sat to one side.

source: །དེ་ནས་ལྷའི་བུ་ཡོངས་སུ་དགའ་ལྡན་དགའ་ལྡན་རིས་ཀྱི་ལྷའི་བུ་དང་ལྷན་ཅིག་ཏུ་དེ་བཞིན་གཤེགས་པ་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་ནས། ལྷའི་གོས་ཀྱི་དྲ་བ་ཆེན་པོས་བྱང་ཆུབ་ཀྱི་སྙིང་པོ་ལ་བཞུགས་པའི་དེ་བཞིན་གཤེགས་པ་ལ་མངོན་པར་བཀབ་སྟེ།
en: Next the god Santuṣita, along with other gods from the Heaven of Joy, approached the Thus-Gone One as he sat at the seat of awakening and draped him with a vast patchwork of divine garments.

source: །ཁྱོད་ནི་དགའ་ལྡན་གནས་ན་བཞུགས་ཚེ་དེར་ནི་ཁྱོད་ཀྱིས་རྒྱ་ཆེན་ཆོས་ཀྱང་བཤད།
en: “When you were dwelling in the Heaven of Joy, you taught the Dharma liberally.

source: །ཁྱོད་ཀྱིས་བསྟན་པ་དེ་ནི་ད་དུང་ལྷ་ཡི་བུ་རྣམས་ཆོས་སྤྱོད་རྒྱུན་མི་འཆད།
en: That teaching of yours continues unabated; even today the gods practice the Dharma.

source: །ཁྱོད་ལ་བལྟ་བས་ངོམས་པར་མི་འགྱུར་ཆོས་མཉན་པས་ཀྱང་ངོམས་པ་རྙེད་མི་འགྱུར།
en: We cannot get enough of looking at you, nor can we get enough of listening to the Dharma;

source: །ཡོན་ཏན་རྒྱ་མཚོ་འཇིག་རྟེན་སྒྲོན་མ་ཁྱོད་ལ་མགོ་དང་ཡིད་ཀྱིས་ཕྱག་འཚལ་ལོ།
en: Ocean of Good Qualities, Lamp of the World, to you we bow with head and heart.

source: །ཁྱོད་ནི་དགའ་ལྡན་གནས་ནས་འཕོས་ཏེ་དེ་ཚེ་ཁྱོད་ཀྱིས་མི་ཁོམ་ཐམས་ཅད་སྦྱངས།
en: “When you departed from the Heaven of Joy, you exhausted all unfortunate states;

source: །གང་ཚེ་བྱང་ཆུབ་ཤིང་དྲུང་བཞུགས་ཚེ་འགྲོ་བ་ཀུན་གྱི་ཉོན་མོངས་རབ་ཏུ་ཞི།
en: Then, while seated at the Bodhi tree, you quelled the afflictions of all beings.

source: །གང་གི་ཆེད་དུ་རྒྱ་ཆེན་བྱང་ཆུབ་བཙལ་བ་བརྙེས་ཏེ་བདུད་ཀྱང་ཕམ་པར་མཛད།
en: To those for whom you discovered vast awakening and defeated Māra,

source: །ཁྱོད་ཀྱི་སྨོན་ལམ་དེ་ནི་རབ་ཏུ་རྫོགས་ཀྱིས་འཁོར་ལོ་རྒྱ་ཆེན་མྱུར་དུ་སྐོར། །ཆོས་འཚལ་བ་དག་ཆོས་མཉན་བགྱི་ཞེས་ཏེ།
en: With your aspiration now fulfilled, quick, turn the wheel of Dharma in detail!

source: །སྲོག་ཆགས་སྟོང་ཕྲག་མང་པོ་སྡོད་ཅིང་མཆིས།
en: “There are many thousands of beings throughout the ten directions; Let the Dharma be heard by those who seek it!

source: །འཁོར་ལོ་རྒྱ་ཆེན་མྱུར་དུ་བསྐོར་དུ་གསོལ།
en: May you make haste to turn the wheel in detail!

source: །སྲོག་ཆགས་སྟོང་རྣམས་སྲིད་ལས་བསྒྲལ་དུ་གསོལ།
en: May you liberate those thousands of creatures from existence!”

source: །དགེ་སློང་དག་དེ་ལྟར་ལྷའི་བུ་ཡོངས་སུ་དགའ་ལྡན་འཁོར་དང་བཅས་པས་དེ་བཞིན་གཤེགས་པ་ལ་མངོན་པར་བསྟོད་ནས་ཐལ་མོ་སྦྱར་ཏེ། དེ་བཞིན་གཤེགས་པ་ལ་ཕྱག་འཚལ་ཞིང་ཕྱོགས་གཅིག་ཏུ་འདུག་གོ།
en: Monks, once the god Santuṣita and his entourage had praised the Thus-Gone One, with palms joined they bowed to him and sat to one side.

source: །དེ་ནས་ལྷའི་རབ་འཐབ་བྲལ་ལ་སོགས་པ་འཐབ་བྲལ་གྱི་ལྷ་རྣམས་བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་དོང་སྟེ་ཕྱིན་ནས། མེ་ཏོག་དང་། སྤོས་དང་། ཕྲེང་བ་དང་། བྱུགས་པ་སྣ་ཚོགས་ཀྱིས་བྱང་ཆུབ་ཀྱི་སྙིང་པོ་ལ་བཞུགས་པའི་དེ་བཞིན་གཤེགས་པ་ལ་མཆོད་དེ། སྤྱན་སྔ་ནས་ཚུལ་དང་འཐུན་པའི་ཚིགས་སུ་བཅད་པ་འདི་དག་གིས་མངོན་པར་བསྟོད་དོ། །ཚུལ་ཁྲིམས་ཏིང་འཛིན་དེ་བཞིན་ཤེས་རབ་ཀྱིས།
en: Then the gods from the Heaven Free from Strife, led by the god Suyāma, went to where the Thus-Gone One was seated. When they arrived, they worshiped the Thus-Gone One sitting at the seat of awakening with a plethora of flowers, incense, garlands, perfumes, and unguents, and in his presence they praised him with these fitting verses:

source: །ཁྱོད་དང་མཚུངས་པ་མ་མཆིས་ག་ལ་ལྷག །མོས་དང་རྣམ་པར་གྲོལ་ལ་མཁས་པ་པོ།
en: “Who is superior to you, you who are without equal In discipline, absorption, and insight? To you, Thus-Gone One, adept in inclinations and liberation,

source: །དེ་བཞིན་གཤེགས་པ་ཁྱོད་ལ་མགོས་ཕྱག་འཚལ།
en: We pay homage with our heads bowed!

source: བྱང་ཆུབ་སྙིང་པོར་ལྷ་ཡིས་གང་བགྱིས་པ།
en: “We witness at the seat of awakening

source: །བཀོད་པ་མཛེས་པ་དེ་དག་མཐོང་ལགས་ཏེ།
en: The magnificent displays performed by the gods.

source: །ཇི་ལྟར་ཁྱོད་ལ་ལྷ་དང་མིས་མཆོད་པ།
en: How you are worshiped by gods and humans!

source: །དེ་ནི་གཞན་གང་ལ་ཡང་འོས་མ་ལགས།
en: No one else deserves this at all!

source: །ཁྱོད་བྱུང་དོན་མ་མཆིས་པ་མ་ལགས་ཏེ།
en: “It is not in vain that you have come,

source: །གང་གི་དོན་དུ་དཀའ་བ་མང་པོ་སྤྱད།
en: Enduring great hardship in the process.

source: །ཤིན་ཏུ་གཡོན་ཅན་སྡེ་དང་བཅས་ལས་རྒྱལ།
en: Defeating the wicked one and his army

source: །ཁྱོད་ཀྱིས་བླ་ན་མེད་པའི་བྱང་ཆུབ་བརྙེས།
en: You attained unexcelled awakening.

source: །ཕྱོགས་བཅུ་དག་ཏུ་སྣང་བ་མཛད་པར་གྱུར།
en: “You have illuminated the ten directions,

source: །ཤེས་རབ་སྒྲོན་མས་འཇིག་རྟེན་གསུམ་པོ་གསལ། །
en: Lit up the three worlds with the lamp of your insight.

source: ཁྱོད་ནི་རབ་རིབ་སེལ་བར་འགྱུར་བ་སྟེ།
en: It is you who will remove the world’s cataracts,

source: །འགྲོ་ལ་བླ་ན་མེད་པའི་མིག་སྦྱིན་པ།
en: Bestowing upon it unexcelled eyes!

source: །ཁྱོད་ལ་བསྟོད་པ་བསྐལ་པར་བརྗོད་ཀྱང་ནི།
en: “Praising you for an eon

source: །ཁྱོད་ཀྱི་བ་སྤུའི་ཁུང་བུ་མཐའ་མ་མཆིས།
en: Will not even cover the pores of your body.

source: །ཡོན་ཏན་རྒྱ་མཚོ་འཇིག་རྟེན་རྣམ་པར་གྲགས།
en: Ocean of Good Qualities, renowned throughout the world,

source: །དེ་ལྟར་ལྷའི་བུ་རབ་འཐབ་བྲལ་ལ་སོགས་པ་འཐབ་བྲལ་གྱི་ལྷའི་བུ་དེ་དག་གིས་དེ་བཞིན་གཤེགས་པ་ལ་མངོན་པར་བསྟོད་ནས་ཐལ་མོ་སྦྱར་ཏེ། དེ་བཞིན་གཤེགས་པ་ལ་ཕྱག་འཚལ་ཞིང་ཕྱོགས་གཅིག་ཏུ་འཁོད་དོ།
en: Once the gods from the Heaven Free from Strife, led by the god Suyāma, had praised the Thus-Gone One, with palms joined they bowed to the Thus-Gone One and then stood to one side.

source: །དེ་ནས་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་སུམ་ཅུ་རྩ་གསུམ་རིས་ཀྱི་ལྷ་རྣམས་དང་ལྷན་ཅིག་ཏུ་མེ་ཏོག་དང་། སྤོས་དང་། ཕྲེང་བ་དང་། བྱུག་པ་དང་། གདུགས་དང་། རྒྱལ་མཚན་དང་། བ་དན་བཀོད་པ་རྣམས་ཀྱིས་དེ་བཞིན་གཤེགས་པ་ལ་མཆོད་ནས་ཚིགས་སུ་བཅད་པ་འདི་དག་གིས་མངོན་པར་བསྟོད་དོ།
en: Then Śakra, lord of the gods, together with the gods from the Heaven of the Thirty-Three, paid homage to the Thus-Gone One with a display of flowers, incense, garlands, unguents, parasols, standards, and flags, then praised him with these verses:

source: །ཐུབ་པ་མ་འཁྲུལ་ཁ་ན་མ་ཐོ་མི་མངའ་རྟག་ཏུ་ལེགས་བཞུགས་ལྷུན་པོ་འདྲ།
en: “O Sage, you are unflappable, faultless, and ever stable, like Mount Meru!

source: །ཕྱོགས་བཅུ་དག་ཏུ་ཡེ་ཤེས་འོད་གྲགས་བསོད་ནམས་དག་དང་གཟི་བརྗིད་ལྡན་པ་པོ།
en: With merit and splendor, your wisdom light is renowned throughout the ten directions!

source: །ཐུབ་པ་ཁྱོད་ཀྱིས་སྔོན་ཆད་སངས་རྒྱས་བརྒྱ་ཕྲག་མཐའ་ཡས་ཡང་དག་མཆོད་པ་མཛད།
en: O Sage, you previously paid homage to hundreds of thousands of buddhas,

source: །དེ་ཡི་ཡུལ་དེ་ཡིས་ནི་བྱང་ཆུབ་ཤིང་དྲུང་བདུད་ཀྱི་སྡེ་ལས་རྒྱལ་བར་གྱུར།
en: And in their place, you have overcome the demon horde at the Bodhi tree!

source: །ཚུལ་ཁྲིམས་དང་ནི་ཐོས་དང་ཏིང་འཛིན་ཤེས་རབ་འབྱུང་གནས་ཡེ་ཤེས་རྒྱལ་མཚན་ཏོག །རྒ་ཤི་འཇོམས་པར་མཛད་པ་སྨན་པ་དམ་པ་འཇིག་རྟེན་དག་ལ་མིག་སྦྱིན་པ།
en: “Source of discipline, learning, absorption, and insight, you are the banner of wisdom! Destroyer of old age and death, you are the supreme physician, who gives eyes to the world!

source: །ཐུབ་པ་དྲི་མ་གསུམ་དང་ཐ་བ་སྤངས་ཤིང་དབང་པོ་ཞི་ལ་ཐུགས་ཞི་བ།
en: O Sage, having cast off the three defilements and defects, your sense faculties are restrained, your mind composed!

source: །ཤཱཀྱ་ཁྱུ་མཆོག་འགྲོ་བ་དག་གི་ཆོས་ཀྱི་རྒྱལ་པོ་ཁྱོད་ལ་སྐྱབས་སུ་མཆི།
en: To you, O Bull among Śākyas, Dharma King of Beings, we go for refuge!

source: །ཁྱོད་ཀྱིས་བརྩོན་འགྲུས་མཐུ་ཡིས་འཕགས་པའི་བྱང་ཆུབ་སྤྱོད་པ་མཐའ་ཡས་གྱུར་ལགས་ཏེ།
en: “Your work to achieve awakening, exalted by the force of your perseverance, was infinite!

source: །ཤེས་རབ་སྟོབས་དང་ཐབས་དང་བྱམས་པའི་སྟོབས་དང་བསོད་ནམས་སྟོབས་རྣམས་དང་། །སྟོབས་རྣམས་དེ་དག་བཅོམ་ལྡན་འདས་ཁྱོད་བྱང་ཆུབ་བཞུགས་པའི་ཚེ་ན་མཐའ་ཡས་ཏེ།
en: Your powers—the powers of your insight, skillful means, love, and great merit— Were already infinite, O Blessed One, when you set out for the state of awakening!

source: །སྟོབས་དང་ལྡན་པ་དེ་རིང་བྱང་ཆུབ་སྙིང་པོར་བཞུགས་ནས་སྟོབས་བཅུ་མངའ་བར་གྱུར།
en: Thus you have the strength of the ten powers today on the seat of awakening!

source: །དཔུང་ཚོགས་མཐའ་ཡས་མཐོང་ནས་དགེ་སྦྱོང་རྒྱལ་པོ་བྱང་ཆུབ་སྙིང་པོར་བཞུགས་པ་དེ། །ཉམས་པར་མི་འགྱུར་གྲང་ཞེས་ལྷ་རྣམས་ཐམས་ཅད་རབ་ཏུ་སྔངས་ཤིང་སྐྲག་པར་གྱུར།
en: “Seeing the infinite hordes of armies, the gods became anxious and frightened, Lest the King of Mendicants in repose at the seat of awakening should be troubled.
